src/app/Http/Controllers/PostController.php

select * from `countries`
---
    public function showCreateForm(){
        if (Auth::check()){
            return response()->view('new', ['countries' => Country::all()]);

select * from `countries`
---
    public function showEditForm($id){
        $post = new Post;
        $post = $post->findOrFail($id);
        if ((Auth::check()) && (Auth::user()->id == $post->user_id)){
//            dd($post);
            return response()->view('edit',['post' => $post,'countries' => Country::all()]);

insert into `posts` (`title`, `description`, `country_id`, `phone`, `email`, `end_date`, `user_id`, `photo`, `updated_at`, `created_at`) values ('fourth', 'ыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыыы', '13', '+1(125)649-7646', 'non@gmail.com', '2020-04-27', 11, 'msfeZM6hXXM8T55irC4zlST2TYrjyfUGZdBFwoHS.jpeg', '2020-04-07 07:48:06', '2020-04-07 07:48:06')
---
    public function saveNew(PostRequest $req){
        $post = new Post();
        $post->title = $req->input('title');
        $post->description = $req->input('description');
        $post->country_id = $req->input('country_id');
        $post->phone = $req->input('phone');
        $post->email = $req->input('email');
        $post->end_date = $req->input('end_date');
        $post->user_id = Auth::user()->id;

        if ($req->photo != null){
            $image = $req->file('photo')->store('public/images');

            $filename = explode('/', $image)[2];
            $post->photo = $filename;
        }
        else {
            $post->photo = null;
        }

        $post->save();